---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarRoundingManager.TotalLengthRoundingMethod
source: html/eaa4edaf-a8b8-aecc-e500-577c02741c57.htm
---
# Autodesk.Revit.DB.Structure.RebarRoundingManager.TotalLengthRoundingMethod Property

Identifies the total length rounding method

## Syntax (C#)
```csharp
public RoundingMethod TotalLengthRoundingMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: IsActiveOnElement property is false.